app/views/clubs/show.html.erb

      <h2>Meetings </h2>
      <% @club.meetings.each do |meeting|%>
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."club_id" = ?  [["club_id", 1]]

              <p> Host: <%= meeting.host %> </p>
              <% meeting.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."meeting_id" = ?  [["meeting_id", 1]]


          <% @club.members.each do |member|%>
---
SELECT "members".* FROM "members" WHERE "members"."club_id" = ?  [["club_id", 1]]