Project_2/book_club/app/views/clubs/show.html.erb

SELECT "meetings".* FROM "meetings" WHERE "meetings"."club_id" = ?  [["club_id", 1]]
---
      <hr class = "big_line">
      <% @club.meetings.each do |meeting|%>

SELECT "books".* FROM "books" WHERE "books"."meeting_id" = ?  [["meeting_id", 1]]
---
        <p> Host: <%= meeting.host %> </p>
        <% meeting.books.each do |book| %>

SELECT "members".* FROM "members" WHERE "members"."club_id" = ?  [["club_id", 1]]
---

          <% @club.members.each do |member|%>