Project_2/book_club/app/controllers/books_controller.rb

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @meeting = Meeting.find(params[:meeting_id])
    @club = Club.find(@meeting.club_id)