Project_2/book_club/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 1]]
---
  def show
    @book = Book.find(params[:id])
    @sum_rating = @book.reviews.reduce do |sum, rating|
        sum + rating
      end
      @average_rating = @sum_rating / @book.reviews.length

SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def new
    @meeting = Meeting.find(params[:meeting_id])

SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "books" ("title", "author", "photo_url", "description", "link", "genre", "meeting_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", "adad"], ["author", ""], ["photo_url", ""], ["description", ""], ["link", ""], ["genre", ""], ["meeting_id", 4], ["user_id", 1]]
---
  def create
    @meeting = Meeting.find(params[:meeting_id])
    @meeting.books.create!(book_params.merge(user: current_user))

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
def edit
    @book = Book.find(params[:id])
    @meeting = Meeting.find(params[:meeting_id])

SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "author" = $1 WHERE "books"."id" = $2  [["author", "qewqe"], ["id", 3]]
---
  def update
    @meeting = Meeting.find(params[:meeting_id])
    @book = Book.find(params[:id])
    if @book.user == current_user
        @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 3]]
---
  def destroy
    @book = Book.find(params[:id])
    if @book.user == current_user
    @book.destroy