Project_2/book_club/app/controllers/meetings_controller.rb

  def new
      @club = Club.find(params[:club_id])
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create

    @club = Club.find(params[:club_id])
    @club.meetings.create!(meeting_params.merge(user: current_user))
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "meetings" ("date", "location", "host", "club_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "7/8/18"], ["location", "NAvy Yard"], ["host", "Laura"], ["club_id", 1], ["user_id", 1]]

  def show
    @meeting = Meeting.find(params[:id])
    @club = @meeting.club
    @book = @meeting.books.first
    @reviews = @book.reviews
    if @reviews.length > 0
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."meeting_id" = ? ORDER BY "books"."id" ASC LIMIT ?  [["meeting_id", 1], ["LIMIT", 1]]
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]

  def edit
    @meeting = Meeting.find(params[:id])
    @club = Club.find(params[:club_id])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @meeting = Meeting.find(params[:id])
    if @meeting.user == current_user
        @meeting.update(meeting_params)
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "meetings" SET "host" = ? WHERE "meetings"."id" = ?  [["host", "Chad"], ["id", 3]]

  def destroy
    @meeting = Meeting.find(params[:id])
    @club = Club.find(@meeting.club_id)

    if @meeting.user == current_user
    @meeting.destroy
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 4]]