Project_2/book_club/app/controllers/members_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @member = Member.find(params[:id])
    @club = Club.find(params[:club_id])

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @club = Club.find(params[:club_id])

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "members" ("name", "email", "street_address", "street_address_2", "city", "state", "zip", "photo_url", "club_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"  [["name", "hi"], ["email", ""], ["street_address", ""], ["street_address_2", ""], ["city", ""], ["state", ""], ["zip", ""], ["photo_url", ""], ["club_id", 1], ["user_id", 1]]
---
  def create
    @club = Club.find(params[:club_id])
    @club.members.create(member_params)

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @member = Member.find(params[:id])
    @club = Club.find(params[:club_id])

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 3]]
---
  def destroy
    @club = Club.find(params[:club_id])
    @member = Member.find(params[:id])
    @member.destroy