Project_2/book_club/app/controllers/reviews_controller.rb

  def new
    @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.find(params[:book_id])
    @club = Club.find(@book.club_id)
    @meeting = Meeting.find(@book.meeting_id)
   @book.reviews.create(review_params.merge(user: current_user))
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "comment", "user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 123123], ["comment", "asdad"], ["user_id", 1], ["book_id", 2], ["created_at", 2017-03-03 21:24:03 UTC], ["updated_at", 2017-03-03 21:24:03 UTC]]

def edit
    @review = Review.find(params[:id])
    @book = Book.find(params[:book_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @review = Review.find(params[:id])

    @book = Book.find(params[:book_id])
    @meeting = Meeting.find(@book.meeting_id)
    if @review.user == current_user
      @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "asdad"], ["updated_at", 2017-03-06 18:50:05 UTC], ["id", 3]]

  def destroy
    @book = Book.find(params[:book_id])
    @review = Review.find(params[:id])
    @meeting = Meeting.find(@book.meeting_id)
    if @review.user == current_user
    @review.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]