app/controllers/clubs_controller.rb

SELECT "clubs".* FROM "clubs"
---
  def index
    @clubs = Club.all

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @club = Club.find(params[:id])

INSERT INTO "clubs" ("name", "start_date", "end_date", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "adslkha"], ["start_date", ""], ["end_date", ""], ["user_id", 1]]
---
  def create
    @club = Club.create(club_params.merge(user: current_user))

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @club = Club.find(params[:id])

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "clubs" SET "start_date" = $1 WHERE "clubs"."id" = $2  [["start_date", "adad"], ["id", 2]]
---
  def update
    @club = Club.find(params[:id])
    if @club.user == current_user
        @club.update(club_params)

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "clubs" WHERE "clubs"."id" = ?  [["id", 2]]
---
  def destroy
    @club = Club.find(params[:id])
    if @club.user == current_user
    @club.destroy