app/controllers/meetings_controller.rb

  def new
      @club = Club.find(params[:club_id])
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @club = Club.find(params[:club_id])
    @meeting = @club.meetings.create!(meeting_params.merge(user: current_user))
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "meetings" ("date", "location", "host", "club_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "7/8/18"], ["location", "NAvy Yard"], ["host", "Laura"], ["club_id", 1], ["user_id", 1]]

  def show
    @meeting = Meeting.find(params[:id])
    @club = Club.find(@meeting.club_id)
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @meeting = Meeting.find(params[:id])
    @club = Club.find(params[:club_id])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @meeting = Meeting.find(params[:id])
    if @meeting.user == current_user
        @meeting.update(meeting_params)
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "meetings" SET "host" = ? WHERE "meetings"."id" = ?  [["host", "Chad"], ["id", 3]]

  def destroy
    @club = Club.find(params[:club_id])
    @meeting = Meeting.find(params[:id])


    if @meeting.user == current_user
    @meeting.destroy
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 4]]