Project_2/book_club/app/views/meetings/show.html.erb

<p> Location: <%= @meeting.location%></p>
    <% @meeting.books.each do |book| %>
---
SELECT  "books".* FROM "books" WHERE "books"."meeting_id" = ? ORDER BY "books"."id" ASC LIMIT ?  [["meeting_id", 1], ["LIMIT", 1]]

    <p>Genre: <%= book.genre %> </p>
    <% if book.reviews.length > 0 %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]